
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
    
    Если Не ЗначениеЗаполнено(Объект.Улица) Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Поле Улица обязательно для заполнения!";
        Сообщение.Поле = "Улица";
        Сообщение.Сообщить();
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    Если Не ЗначениеЗаполнено(Объект.Дом) Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Поле Дом обязательно для заполнения!";
        Сообщение.Поле = "Дом";
        Сообщение.Сообщить();
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    Если Не ЗначениеЗаполнено(Объект.Страна) Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Поле Страна обязательно для заполнения!";
        Сообщение.Поле = "Страна";
        Сообщение.Сообщить();
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    Если Не ЗначениеЗаполнено(Объект.Регион) Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Поле Регион обязательно для заполнения!";
        Сообщение.Поле = "Регион";
        Сообщение.Сообщить();
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    Если Не ЗначениеЗаполнено(Объект.Город) Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Поле Город обязательно для заполнения!";
        Сообщение.Поле = "Город";
        Сообщение.Сообщить();
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    // Формируем наименование из Улица и Дом с суффиксом "ул"
    Объект.Наименование = СокрЛП(Объект.Улица) + " ул" + ?(ЗначениеЗаполнено(Объект.Дом), ", дом № " + СокрЛП(Объект.Дом), "");
    
    // Убедимся, что длина Наименование не превышает 150 символов
    Объект.Наименование = Лев(Объект.Наименование, 150);
КонецПроцедуры

// Модуль формы справочника ЛокальныеУведомления (ФормаЭлемента)
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПараметрыСеанса.ЭтоМобильныйКлиент Тогда 
        Элементы.Код.ТолькоПросмотр = Истина;
		Элементы.Наименование.ТолькоПросмотр = Истина;
		Элементы.Страна.ТолькоПросмотр = Истина;
		Элементы.Регион.ТолькоПросмотр = Истина;
		Элементы.Город.ТолькоПросмотр = Истина;
		Элементы.Улица.ТолькоПросмотр = Истина;
		Элементы.Дом.ТолькоПросмотр = Истина;
		Элементы.Индекс.ТолькоПросмотр = Истина;
	Иначе 
		Сообщить("Это сервер");
	КонецЕсли;
		
КонецПроцедуры