&НаКлиенте
Процедура Готово(Команда)
    
    // Проверка заполненности полей    
    Если ПустаяСтрока(НаборКонстант.АдресЦентральнойБазы) Тогда
        ПоказатьПредупреждение(, "Заполните поле Адрес центральной базы!");
        Возврат;
	КонецЕсли;
	
	// Проверка заполненности полей    
    Если ПустаяСтрока(НаборКонстант.ПространствоИменВебСервиса) Тогда
        ПоказатьПредупреждение(, "Заполните поле Пространство имен веб сервиса!");
        Возврат;
	КонецЕсли;
	        
    Попытка        
        ЗаписатьКонстантыИОбновитьПланОбменаНаСервере();
        Закрыть(); // Закрываем форму
		ОткрытьФорму("ОбщаяФорма.Авторизация");
		СервисАвторизации.ПроверкаУзла();
    Исключение
        ПоказатьПредупреждение(, "Ошибка при сохранении данных: " + ОписаниеОшибки());
    КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
    // Отключаем запрос на сохранение изменений при закрытии формы
    Если Модифицированность Тогда
        Модифицированность = Ложь; // Сбрасываем модифицированность
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКонстантыИОбновитьПланОбменаНаСервере()
    
    // Запись значений констант
    Попытка
        Константы.АдресЦентральнойБазы.Установить(НаборКонстант.АдресЦентральнойБазы);
		Константы.ПространствоИменВебСервиса.Установить(НаборКонстант.ПространствоИменВебСервиса);
        // Сбрасываем модифицированность формы после сохранения
        Модифицированность = Ложь;
    Исключение
        ВызватьИсключение "Не удалось записать константы: " + ОписаниеОшибки();
	КонецПопытки;
КонецПроцедуры