// Модуль формы справочника ЛокальныеУведомления (ФормаЭлемента)
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПараметрыСеанса.ЭтоМобильныйКлиент Тогда 
        Элементы.Код.ТолькоПросмотр = Истина;
		Элементы.Наименование.ТолькоПросмотр = Истина;
		Элементы.Наименование.ТолькоПросмотр = Истина;
		Элементы.Пассажир.ТолькоПросмотр = Истина;
		Элементы.ИдентификаторУведомления.ТолькоПросмотр = Истина;
		Элементы.Поездка.ТолькоПросмотр = Истина;
	Иначе 
		Сообщить("Это сервер");
	КонецЕсли;
		
КонецПроцедуры