
&НаКлиенте
Процедура ПриНачалеРаботыСистемы()
	Если ЭтоМобильноеПриложениеКлиент() Тогда
		
		СервисАвторизации.ПроверитьУстройства(Истина);
		
        Если СервисАвторизации.ПроверитьКонстанты() Тогда
            СервисАвторизации.ПроверкаУзла();
            ОткрытьФорму("ОбщаяФорма.Авторизация");
        Иначе 
            ОткрытьФорму("ОбщаяФорма.ДобавитьURL");
		КонецЕсли;
	Иначе 
		
		СервисАвторизации.ПроверитьУстройства(Ложь);	
		
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ЭтоМобильноеПриложениеКлиент()
    #Если МобильноеПриложениеКлиент Тогда
        Возврат Истина;
    #Иначе
        Возврат Ложь;
    #КонецЕсли
КонецФункции